# 클린 코드 프론트엔드 | 프리온보딩 FE 챌린지 11월 (2023)

>https://www.wanted.co.kr/events/pre_challenge_fe_15
>
>과제를 제출하고 싶다면 결과물을 Gist Comment에 남겨주세요 (Link로 대체 가능)

## 챌린지 과제

### Q1. 내가 생각하는 클린 코드란?

어떤 누군가가 보더라도 항상 같은 의도를 파악할 수 있고, 깔끔하며, 앞으로 어떻게 전개되겠다 예상을 할 수 있는 코드.

### Q2. 내가 생각하는 (프론트엔드에서의) 클린 코드란?

정해진 규칙에 의거하여 파일명과 변수명 등 코딩을 하고, 다른 작업자가 이어 받았을 경우에도 쉽게 이해할 수 있어야 한다.

### Q3. 내가 클린코드보다 중요하게 생각하는 것은?

본인의 의도를 완벽하게 깔끔하게 녹여내었다고 해도 그 코드가 남들에게는 이해가 되지 않는다면 클린코드라고 할 수 없다. 클린코드보다 더 중요하게 생각하는 것은
먼저 다른 사람과의 커뮤니케이션 능력이다. 


### Q4. 다음 중 선호하는 방식과 그 이유는?

##### 1.

`Tab` vs `Space`

tab 방식을 선호한다. 프리티어를 이용하여 작업자와 정해진 인덴스를 설정한 후, tab 한번으로 해당 영역을 띄운다.

##### 2.

`세미콜론 O` vs `세미콜론 X`

자바스크립트는 세미콜론을 찍지 않아도 컴파일에서 알아서 이해한다고 한다. 그러나 가독성을 위해서 최대한 찍는 것이 좋다. 세미콜론이 한 로직의 종료 명시적으로 뜻하기도 하며, 다른 협업자가 다른 프로그래밍언어나 이제 막 배우기 시작한 사람이 있을 수 있기 때문에 배려이기도 하다. 

##### 3.

`count++;` vs `count += 1;` vs `count = count + 1;`

대부분의 경우 count++가 정확한 의도가 있고 단축되어 깔끔하지만, 추후 증가값의 변화가 있을 수 있다생각하여 확장의 의미로 count = count + 1 을 선호한다. 


##### 4.

`if (isLogin) {}` vs `if (isLogin === true) {}`

전자를 선호한다. true를 명시적으로 작성하지 않고 축약해도 모두가 이해할 수 있고 더 깔끔하다.

##### 5.

`isLogin && <HelloWanted />` vs `isLogin ? <HelloWanted /> : <></>` vs `isLogin ? <HelloWanted /> : null` vs `isLogin ? <HelloWanted /> : undfined`

첫번째를 선호한다. 의도하는 로직이 '로그인이 되어있다면 HelloWanted 컴포넌트를 랜더링 하라'는 것인데 그걸 녹여내면서 간결한 코드가 첫번째이다.
